### pandas explanation

What is EDA?:
    <br> Finding attributes, missing values, finding correlation, and performing visualization

### Dataframe

In [2]:
import pandas as pd
import numpy as np

In [6]:
data =  {
    'state' : ['New York','New York','New York','Florida','Florida','New York','California'],
    'year' : [2008, 2010, 2011, 2008, 2010, 2008,2010],
    'pop' : [20.1, 19,4,18,7,10,np.nan]
}

df = pd.DataFrame(data)

In [7]:
df

        state  year   pop
0    New York  2008  20.1
1    New York  2010  19.0
2    New York  2011   4.0
3     Florida  2008  18.0
4     Florida  2010   7.0
5    New York  2008  10.0
6  California  2010   NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   7 non-null      object
 1   year    7 non-null      int64
 2   pop     6 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 296.0+ bytes

In [21]:
print('No of rows and cols are',df.shape)

print('No of columns in first row are',df.shape[1])

No of rows and cols are (7, 3)
No of columns in first row are 3

In [23]:
df.head()

      state  year   pop
0  New York  2008  20.1
1  New York  2010  19.0
2  New York  2011   4.0
3   Florida  2008  18.0
4   Florida  2010   7.0

In [12]:
df.head(3)

      state  year   pop
0  New York  2008  20.1
1  New York  2010  19.0
2  New York  2011   4.0

In [13]:
df.tail(2)

        state  year   pop
5    New York  2008  10.0
6  California  2010   NaN

In [14]:
#column selection

df['state']

0      New York
1      New York
2      New York
3       Florida
4       Florida
5      New York
6    California
Name: state, dtype: object

In [15]:
df.ndim

2

In [18]:
x = pd.DataFrame(np.random.randn(6,4), columns=['A','B','C','D'])

print(x.iloc[:4])

          A         B         C         D
0 -0.352667  0.521270  1.943737 -0.885564
1 -0.874438 -0.424460  0.493683  0.193600
2  0.700816 -1.011208  1.764783 -0.853368
3 -0.661629 -1.323590  0.835763  0.999303

In [25]:
df.index = ['first', 'second', 'third','fourth','fifth','sixth','seventh']

In [26]:
df

              state  year   pop
first      New York  2008  20.1
second     New York  2010  19.0
third      New York  2011   4.0
fourth      Florida  2008  18.0
fifth       Florida  2010   7.0
sixth      New York  2008  10.0
seventh  California  2010   NaN

In [31]:
df.describe()

              year        pop
count     7.000000   6.000000
mean   2009.285714  13.016667
std       1.253566   6.890694
min    2008.000000   4.000000
25%    2008.000000   7.750000
50%    2010.000000  14.000000
75%    2010.000000  18.750000
max    2011.000000  20.100000

In [32]:
#above things were not featured for all columns so use this method
df.describe(include = 'all')

           state         year        pop
count          7     7.000000   6.000000
unique         3          NaN        NaN
top     New York          NaN        NaN
freq           4          NaN        NaN
mean         NaN  2009.285714  13.016667
std          NaN     1.253566   6.890694
min          NaN  2008.000000   4.000000
25%          NaN  2008.000000   7.750000
50%          NaN  2010.000000  14.000000
75%          NaN  2010.000000  18.750000
max          NaN  2011.000000  20.100000

In [35]:
sorted = df.sort_index()
print(sorted)

              state  year   pop
fifth       Florida  2010   7.0
first      New York  2008  20.1
fourth      Florida  2008  18.0
second     New York  2010  19.0
seventh  California  2010   NaN
sixth      New York  2008  10.0
third      New York  2011   4.0

In [37]:
df.mean()

year    2009.285714
pop       13.016667
dtype: float64

In [40]:
# mean of state
df['year'].mean()

14065.0

In [41]:
#display the columns of dataset
df.columns

Index(['state', 'year', 'pop'], dtype='object')

In [72]:
#grouping in pandas

#split data in groups
df.groupby('year')

#view groups
print(df.groupby('year').groups)

{2008: ['first', 'fourth', 'sixth'], 2010: ['second', 'fifth', 'seventh'], 2011: ['third']}

In [43]:
df.state

first        New York
second       New York
third        New York
fourth        Florida
fifth         Florida
sixth        New York
seventh    California
Name: state, dtype: object

In [48]:
a = pd.DataFrame([{'a':1,'b':2}, {'b' :3, 'c':4},{'a' :2, 'c':5 }])
print(a)

     a    b    c
0  1.0  2.0  NaN
1  NaN  3.0  4.0
2  2.0  NaN  5.0

In [55]:
#index methd
df.index

Index(['first', 'second', 'third', 'fourth', 'fifth', 'sixth', 'seventh'], dtype='object')

In [57]:
a.isnull().sum().sum()

3

In [58]:
#null in row wise
a.isnull().sum()

a    1
b    1
c    1
dtype: int64

In [59]:
a.isnull()

       a      b      c
0  False  False   True
1   True  False  False
2  False   True  False

In [63]:
a.iloc[0]['a']

1.0

In [64]:
#drop rows
print(a.dropna(), '\n\n')

Empty DataFrame
Columns: [a, b, c]
Index: []

In [69]:
print(a.dropna())

Empty DataFrame
Columns: [a, b, c]
Index: []

In [67]:
print(a.dropna(axis = 'columns'))

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [73]:
df2 = pd.DataFrame([
            [1,np.nan,2],
            [2,4,5],
            [np.nan, 4,6]
])

In [79]:
df2.index = ['first', 'second','third']

In [80]:
df2

        first  second  third
first     1.0     NaN      2
second    2.0     4.0      5
third     NaN     4.0      6

In [86]:
#not null
df2

        first  second  third
first     1.0     NaN      2
second    2.0     4.0      5
third     NaN     4.0      6

In [85]:
#fillna method
df2.fillna(method = 'ffill',axis = 1)
df2.fillna(method = 'bfill',axis = 1)

        first  second  third
first     1.0     1.0    2.0
second    2.0     4.0    5.0
third     NaN     4.0    6.0

In [87]:
df2

        first  second  third
first     1.0     NaN      2
second    2.0     4.0      5
third     NaN     4.0      6

In [88]:
df

              state  year   pop
first      New York  2008  20.1
second     New York  2010  19.0
third      New York  2011   4.0
fourth      Florida  2008  18.0
fifth       Florida  2010   7.0
sixth      New York  2008  10.0
seventh  California  2010   NaN

In [96]:
students = [
    ('jack', 34, 'Sydney','Australia'),
    ('jones', 43, 'Hyderabad','India'),
    ('jaao', 34, 'America','USA'),
    ('kuch hai', 54, 'Melbourne','Australia'),
    
]

frame = pd.DataFrame(students, columns = ['Name','Age','City', 'Country'])

In [100]:
df.append(a, ignore_index='False')

        state    year   pop    a    b    c
0    New York  2008.0  20.1  NaN  NaN  NaN
1    New York  2010.0  19.0  NaN  NaN  NaN
2    New York  2011.0   4.0  NaN  NaN  NaN
3     Florida  2008.0  18.0  NaN  NaN  NaN
4     Florida  2010.0   7.0  NaN  NaN  NaN
5    New York  2008.0  10.0  NaN  NaN  NaN
6  California  2010.0   NaN  NaN  NaN  NaN
7         NaN     NaN   NaN  1.0  2.0  NaN
8         NaN     NaN   NaN  NaN  3.0  4.0
9         NaN     NaN   NaN  2.0  NaN  5.0

In [108]:
df
row3 = df.loc['first']['year']
print(row3)

2008

In [105]:
df

              state  year   pop
first      New York  2008  20.1
second     New York  2010  19.0
third      New York  2011   4.0
fourth      Florida  2008  18.0
fifth       Florida  2010   7.0
sixth      New York  2008  10.0
seventh  California  2010   NaN

In [109]:
print(pd.Series(['Raju',21,'bangalore',34]))

0         Raju
1           21
2    bangalore
3           34
dtype: object

In [110]:
#how to add a new column in the dataset
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
  
# Declare a list that is to be converted into a column
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']
  
# Using 'Address' as the column name
# and equating it to the list
df['Address'] = address
  
# Observe the result
print(df)

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [111]:
df = df.append(pd.Series(['Chacha',5.7,'BBC','Hyderabad me nai hai'],index = df.columns), ignore_index = True)

In [112]:
df

     Name  Height Qualification               Address
0     Jai     5.1           Msc                 Delhi
1  Princi     6.2            MA             Bangalore
2  Gaurav     5.1           Msc               Chennai
3    Anuj     5.2           Msc                 Patna
4  Chacha     5.7           BBC  Hyderabad me nai hai

In [114]:
=

In [115]:
df

     Name  Height Qualification               Address       k
0     Jai     5.1           Msc                 Delhi       3
1  Princi     6.2            MA             Bangalore  Smriti
2  Gaurav     5.1           Msc               Chennai     5.2
3    Anuj     5.2           Msc                 Patna     BBO
4  Chacha     5.7           BBC  Hyderabad me nai hai      NA

In [117]:
# read the data from the downloaded CSV file.
data = pd.read_csv('https://s3-eu-west-1.amazonaws.com/shanebucket/downloads/uk-500.csv')
# set a numeric id for use as an index for examples.
#data['id'] = [random.randint(0,1000) for x in range(data.shape[0])]
data

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk
...,...,...,...,...,...,...,...,...,...,...,...
495,Avery,Veit,Plaza Gourmet Delicatessen,9166 Devon St #905,Knightsbridge and Belgravia Wa,Greater London,SW1W 8JY,01748-625058,01369-185737,avery@veit.co.uk,http://www.plazagourmetdelicatessen.co.uk
496,Reid,Euresti,"Fitzgerald, Edward J",70 Foster St,Inverness Ness-Side Ward,Highland,IV2 6WT,01916-963261,01370-319414,reuresti@euresti.co.uk,http://www.fitzgeraldedwardj.co.uk
497,Charlette,Brenning,Furey & Associates,714 Fonthill Rd,Darton West Ward,South Yorkshire,S75 5EJ,01888-152110,01301-312487,cbrenning@brenning.co.uk,http://www.fureyassociates.co.uk
498,Celestina,Keeny,Bfg Federal Credit Union,9 Milton St,Consett North ED,County Durham,DH8 5LP,01877-379681,01600-463475,celestina_keeny@gmail.com,http://www.bfgfederalcreditunion.co.uk
499,Mi,Richan,Nelson Wright Haworth Golf Crs,6 Norwood Grove,Tanworth-in-Arden,Warwickshire,B94 5RZ,01451-785624,01202-738406,mi@hotmail.com,http://www.nelsonwrighthaworthgolfcrs.co.uk

In [123]:
#data.shape[0] = no of rows

import random
data['id'] = [random.randint(0,1000) for x in range(data.shape[0])]

In [126]:
data.columns

Index(['first_name', 'last_name', 'company_name', 'address', 'city', 'county',
       'postal', 'phone1', 'phone2', 'email', 'web', 'id'],
      dtype='object')

In [128]:
print(data.shape)
print(data.info())
print(data.describe())

(500, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    500 non-null    object
 1   last_name     500 non-null    object
 2   company_name  500 non-null    object
 3   address       500 non-null    object
 4   city          500 non-null    object
 5   county        500 non-null    object
 6   postal        500 non-null    object
 7   phone1        500 non-null    object
 8   phone2        500 non-null    object
 9   email         500 non-null    object
 10  web           500 non-null    object
 11  id            500 non-null    int64
dtypes: int64(1), object(11)
memory usage: 47.0+ KB
None
                id
count   500.000000
mean    501.352000
std     283.117317
min       1.000000
25%     249.250000
50%     501.000000
75%     749.250000
max    1000.000000

In [132]:
data.head(3)

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web,id
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk,873
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk,411
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk,763

In [133]:
data.loc[[0]]

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web,id
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk,873

In [135]:
data.loc[0]

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
id                                               873
Name: 0, dtype: object

In [168]:
# Single selections using iloc and DataFrame
# Rows:
print(data.iloc[0]) # first row of data frame (Aleshia Tomkiewicz) - Note a Series data type output.
print()
print(data.iloc[[1]]) # second row of data frame (Evan Zigomalas)
print()
print(data.iloc[-1]) # last row of data frame (Mi Richan)
print()
# Columns:
print(data.iloc[:,0]) # first column of data frame (first_name)
print()
print(data.iloc[:,1]) # second column of data frame (last_name)
print()
print(data.iloc[:,-1]) # last column of data frame (id)
print()

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
id                                               873
Name: 0, dtype: object

  first_name  last_name        company_name      address        city  \
1       Evan  Zigomalas  Cap Gemini America  5 Binney St  Abbey Ward

            county    postal        phone1        phone2  \
1  Buckinghamshire  HP11 2AX  01937-864715  01714-737668

                      email                                web   id
1  evan.zigomalas@gmail.com  http://www.capgeminiamerica.co.uk  411

first_name                                               Mi
last_name                                            Richan
company_name                 Nelson Wright Haworth Golf Crs
address                                     6 Norwood Grove
city                                      Tanworth-in-Arden
county                                         Warwickshire
postal                                              B94 5RZ
phone1                                         01451-785624
phone2                                         01202-738406
email                                        mi@hotmail.com
web             http://www.nelsonwrighthaworthgolfcrs.co.uk
id                                                      376
Name: 499, dtype: object

0        Aleshia
1           Evan
2         France
3        Ulysses
4         Tyisha
         ...
495        Avery
496         Reid
497    Charlette
498    Celestina
499           Mi
Name: first_name, Length: 500, dtype: object

0      Tomkiewicz
1       Zigomalas
2         Andrade
3       Mcwalters
4          Veness
          ...
495          Veit
496       Euresti
497      Brenning
498         Keeny
499        Richan
Name: last_name, Length: 500, dtype: object

0      873
1      411
2      763
3      835
4      911
      ...
495    171
496     36
497    228
498    276
499    376
Name: id, Length: 500, dtype: int64

In [155]:
data.iloc[2,:]

first_name                                France
last_name                                Andrade
company_name                 Elliott, John W Esq
address                             8 Moor Place
city              East Southbourne and Tuckton W
county                               Bournemouth
postal                                   BH6 3BE
phone1                              01347-368222
phone2                              01935-821636
email                 france.andrade@hotmail.com
web             http://www.elliottjohnwesq.co.uk
id                                           763
Name: 2, dtype: object

In [156]:
print(data.iloc[0:5])

  first_name   last_name             company_name            address  \
0    Aleshia  Tomkiewicz  Alan D Rosenburg Cpa Pc       14 Taylor St
1       Evan   Zigomalas       Cap Gemini America        5 Binney St
2     France     Andrade      Elliott, John W Esq       8 Moor Place
3    Ulysses   Mcwalters           Mcmahan, Ben L      505 Exeter Rd
4     Tyisha      Veness           Champagne Room  5396 Forth Street

                             city           county    postal        phone1  \
0               St. Stephens Ward             Kent   CT2 7PP  01835-703597
1                      Abbey Ward  Buckinghamshire  HP11 2AX  01937-864715
2  East Southbourne and Tuckton W      Bournemouth   BH6 3BE  01347-368222
3              Hawerby cum Beesby     Lincolnshire  DN36 5RP  01912-771311
4      Greets Green and Lyng Ward    West Midlands   B70 9DT  01547-429341

         phone2                       email  \
0  01944-369967     atomkiewicz@hotmail.com
1  01714-737668    evan.zigomalas@gmail.com
2  01935-821636  france.andrade@hotmail.com
3  01302-601380         ulysses@hotmail.com
4  01290-367248   tyisha.veness@hotmail.com

                                    web   id
0  http://www.alandrosenburgcpapc.co.uk  873
1     http://www.capgeminiamerica.co.uk  411
2      http://www.elliottjohnwesq.co.uk  763
3          http://www.mcmahanbenl.co.uk  835
4        http://www.champagneroom.co.uk  911

In [157]:
print(data.iloc[:,0:2])

    first_name   last_name
0      Aleshia  Tomkiewicz
1         Evan   Zigomalas
2       France     Andrade
3      Ulysses   Mcwalters
4       Tyisha      Veness
..         ...         ...
495      Avery        Veit
496       Reid     Euresti
497  Charlette    Brenning
498  Celestina       Keeny
499         Mi      Richan

[500 rows x 2 columns]

In [167]:
print(data.iloc[[0,3,6,24], [0,5,6]])

   first_name        county    postal
0     Aleshia          Kent   CT2 7PP
3     Ulysses  Lincolnshire  DN36 5RP
6        Marg   Southampton  SO14 3TY
24       Tess   West Sussex  PO19 1RH

In [163]:
print(data.iloc[0:5, 3:6])

             address                            city           county
0       14 Taylor St               St. Stephens Ward             Kent
1        5 Binney St                      Abbey Ward  Buckinghamshire
2       8 Moor Place  East Southbourne and Tuckton W      Bournemouth
3      505 Exeter Rd              Hawerby cum Beesby     Lincolnshire
4  5396 Forth Street      Greets Green and Lyng Ward    West Midlands

In [176]:
#default we get series type in iloc, hence we use [[]] then we get [[]] to get dataframe as type
data.columns
data.loc[[0][0]]

first_name                                   Aleshia
last_name                                 Tomkiewicz
company_name                 Alan D Rosenburg Cpa Pc
address                                 14 Taylor St
city                               St. Stephens Ward
county                                          Kent
postal                                       CT2 7PP
phone1                                  01835-703597
phone2                                  01944-369967
email                        atomkiewicz@hotmail.com
web             http://www.alandrosenburgcpapc.co.uk
id                                               873
Name: 0, dtype: object

In [182]:
#its important to name the column of the index
data

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web,id
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk,873
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk,411
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk,763
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk,835
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk,911
...,...,...,...,...,...,...,...,...,...,...,...,...
495,Avery,Veit,Plaza Gourmet Delicatessen,9166 Devon St #905,Knightsbridge and Belgravia Wa,Greater London,SW1W 8JY,01748-625058,01369-185737,avery@veit.co.uk,http://www.plazagourmetdelicatessen.co.uk,171
496,Reid,Euresti,"Fitzgerald, Edward J",70 Foster St,Inverness Ness-Side Ward,Highland,IV2 6WT,01916-963261,01370-319414,reuresti@euresti.co.uk,http://www.fitzgeraldedwardj.co.uk,36
497,Charlette,Brenning,Furey & Associates,714 Fonthill Rd,Darton West Ward,South Yorkshire,S75 5EJ,01888-152110,01301-312487,cbrenning@brenning.co.uk,http://www.fureyassociates.co.uk,228
498,Celestina,Keeny,Bfg Federal Credit Union,9 Milton St,Consett North ED,County Durham,DH8 5LP,01877-379681,01600-463475,celestina_keeny@gmail.com,http://www.bfgfederalcreditunion.co.uk,276
499,Mi,Richan,Nelson Wright Haworth Golf Crs,6 Norwood Grove,Tanworth-in-Arden,Warwickshire,B94 5RZ,01451-785624,01202-738406,mi@hotmail.com,http://www.nelsonwrighthaworthgolfcrs.co.uk,376

In [192]:
data.set_index("last_name", inplace=True)

In [193]:
data.head(4)

,company_name,address,city,county,postal,phone1,phone2,email,web,id
last_name,,,,,,,,,,
Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk,873
Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk,411
Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk,763
Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk,835

In [186]:
print(data.iloc[0:5, 3:6])

                                      city           county    postal
first_name
Aleshia                  St. Stephens Ward             Kent   CT2 7PP
Evan                            Abbey Ward  Buckinghamshire  HP11 2AX
France      East Southbourne and Tuckton W      Bournemouth   BH6 3BE
Ulysses                 Hawerby cum Beesby     Lincolnshire  DN36 5RP
Tyisha          Greets Green and Lyng Ward    West Midlands   B70 9DT

In [194]:
# Select rows with index values 'Andrade' and 'Veness', with all columns between 'city' and 'email'
data.loc[['Andrade', 'Veness'], 'city':'email']

,city,county,postal,phone1,phone2,email
last_name,,,,,,
Andrade,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com
Veness,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com

In [196]:
data.loc['Andrade':'Veness', ['address', 'city']]

                     address                            city
last_name
Andrade         8 Moor Place  East Southbourne and Tuckton W
Mcwalters      505 Exeter Rd              Hawerby cum Beesby
Veness     5396 Forth Street      Greets Green and Lyng Ward